from gtts import gTTS
from playsound import playsound
text = """भारत का संविधान
संविधान भारत का सर्वोच्च कानून है। यह एक लिखित दस्तावेज है जो सरकार और उसके संगठनों के मौलिक बुनियादी संहिता, संरचना, प्रक्रियाओं, शक्तियों और कर्तव्यों और नागरिकों के अधिकारों और कर्तव्यों का निर्धारण करने वाले ढांचे को निर्धारित करता है।
इसे 26 नवंबर 1949 को संविधान सभा द्वारा अंगीकृत किया गया था और यह 26 जनवरी 1950 को लागू हुआ। इसको अंगीकृत किये जाने के समय, संविधान में 395 अनुच्छेद और 8 अनुसूचियां थीं और इसमें लगभग 145,000 शब्द थे, जिससे यह अब तक का अंगीकृत किया जाने वाला सबसे लंबा राष्ट्रीय संविधान बन गया। संविधान के प्रत्येक अनुच्छेद पर संविधान सभा के सदस्यों द्वारा बहस की गई, जिनकी संविधान के निर्माण के लिए 2 वर्ष और 11 महीने की अवधि में 11 सत्रों में और 167 दिनों के दौरान बैठक हुई।
संविधान की प्रस्..."""



tts = gTTS(text, lang='hi')
tts.save("test.mp3")
playsound("test.mp3")
